app/controllers/users_controller.rb

  def find_user
    if params[:id] == 'current'
      @user = current_user
    else
      @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1